---
kind: method
id: M:Autodesk.Revit.DB.PolymeshTopology.GetUVs
source: html/26697f0c-570d-b8c4-25eb-782aeea404e6.htm
---
# Autodesk.Revit.DB.PolymeshTopology.GetUVs Method

Returns all UV coordinates assigned to the polymesh

## Syntax (C#)
```csharp
public IList<UV> GetUVs()
```

## Returns
An array of UV coordinates